# ===============================================目标========================================================

print('今天是2026年7月1日，我要每天坚持学习Pyhton，希望三年后能在外企大厂工作，成为一名优秀的Python开发工程师！')


# 算术运算符 : + - * / // % **
# 1.加法运算符 + ：两个数相加，结果是它们的和。
# 2.减法运算符 - ：一个数减去另一个数，结果是它们的差。
# 3.乘法运算符 * ：两个数相乘，结果是它们的积。
# 4.除法运算符 / ：两个数相除，结果是浮点数商。
# 5.整除运算符 // ：两个数相除，结果向下取整为商的整数部分。
# 6.取余运算符 % ：两个数相除，结果是余数。
# 7.幂运算符 ** ：左边的数作为底数，右边的数作为指数，求幂运算结果。
print(10 + 5)   # 输出 15
print(10 - 5)   # 输出 5
print(10 * 5)   # 输出 50
print(10 / 5)   # 输出 2.0
print(10 // 3)  # 输出 3
print(10 % 3)   # 输出 1
print(2 ** 3)   # 输出 8
